---
kind: property
id: P:Autodesk.Revit.DB.SpecTypeId.StationingInterval
source: html/39342ab6-2b6b-7572-a2ad-897429b50e34.htm
---
# Autodesk.Revit.DB.SpecTypeId.StationingInterval Property

Stationing Interval, in discipline Infrastructure.

## Syntax (C#)
```csharp
public static ForgeTypeId StationingInterval { get; }
```